PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p18f65k40.inc
;----- PIE0 Bits -----------------------------------------------------
INT0IE           EQU  H'0000'
INT1IE           EQU  H'0001'
INT2IE           EQU  H'0002'
INT3IE           EQU  H'0003'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'


;----- PIE1 Bits -----------------------------------------------------
ADIE             EQU  H'0000'
ADTIE            EQU  H'0001'
CSWIE            EQU  H'0006'
OSCFIE           EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
C1IE             EQU  H'0000'
C2IE             EQU  H'0001'
C3IE             EQU  H'0002'
ZCDIE            EQU  H'0006'
HLVDIE           EQU  H'0007'


;----- PIE3 Bits -----------------------------------------------------
SSP1IE           EQU  H'0000'
BCL1IE           EQU  H'0001'
SSP2IE           EQU  H'0002'
BCL2IE           EQU  H'0003'
TX1IE            EQU  H'0004'
RC1IE            EQU  H'0005'
TX2IE            EQU  H'0006'
RC2IE            EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
TX3IE            EQU  H'0000'
RC3IE            EQU  H'0001'
TX4IE            EQU  H'0002'
RC4IE            EQU  H'0003'
TX5IE            EQU  H'0004'
RC5IE            EQU  H'0005'


;----- PIE5 Bits -----------------------------------------------------
TMR1IE           EQU  H'0000'
TMR2IE           EQU  H'0001'
TMR3IE           EQU  H'0002'
TMR4IE           EQU  H'0003'
TMR5IE           EQU  H'0004'
TMR6IE           EQU  H'0005'
TMR7IE           EQU  H'0006'
TMR8IE           EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
TMR1GIE          EQU  H'0000'
TMR3GIE          EQU  H'0001'
TMR5GIE          EQU  H'0002'
TMR7GIE          EQU  H'0003'


;----- PIE7 Bits -----------------------------------------------------
CCP1IE           EQU  H'0000'
CCP2IE           EQU  H'0001'
CCP3IE           EQU  H'0002'
CCP4IE           EQU  H'0003'
CCP5IE           EQU  H'0004'


;----- PIE8 Bits -----------------------------------------------------
CWG1IE           EQU  H'0000'
NVMIE            EQU  H'0005'
CRCIE            EQU  H'0006'
SCANIE           EQU  H'0007'


;----- PIE9 Bits -----------------------------------------------------
SMU1IE           EQU  H'0000'
SMU1PRAIE        EQU  H'0001'
SMU1PWAIE        EQU  H'0002'
SMU2IE           EQU  H'0003'
SMU2PRAIE        EQU  H'0004'
SMU2PWAIE        EQU  H'0005'


;----- PIR0 Bits -----------------------------------------------------
INT0IF           EQU  H'0000'
INT1IF           EQU  H'0001'
INT2IF           EQU  H'0002'
INT3IF           EQU  H'0003'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
ADIF             EQU  H'0000'
ADTIF            EQU  H'0001'
CSWIF            EQU  H'0006'
OSCFIF           EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
C1IF             EQU  H'0000'
C2IF             EQU  H'0001'
C3IF             EQU  H'0002'
ZCDIF            EQU  H'0006'
HLVDIF           EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
SSP1IF           EQU  H'0000'
BCL1IF           EQU  H'0001'
SSP2IF           EQU  H'0002'
BCL2IF           EQU  H'0003'
TX1IF            EQU  H'0004'
RC1IF            EQU  H'0005'
TX2IF            EQU  H'0006'
RC2IF            EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
TX3IF            EQU  H'0000'
RC3IF            EQU  H'0001'
TX4IF            EQU  H'0002'
RC4IF            EQU  H'0003'
TX5IF            EQU  H'0004'
RC5IF            EQU  H'0005'


;----- PIR5 Bits -----------------------------------------------------
TMR1IF           EQU  H'0000'
TMR2IF           EQU  H'0001'
TMR3IF           EQU  H'0002'
TMR4IF           EQU  H'0003'
TMR5IF           EQU  H'0004'
TMR6IF           EQU  H'0005'
TMR7IF           EQU  H'0006'
TMR8IF           EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
TMR1GIF          EQU  H'0000'
TMR3GIF          EQU  H'0001'
TMR5GIF          EQU  H'0002'
TMR7GIF          EQU  H'0003'


;----- PIR7 Bits -----------------------------------------------------
CCP1IF           EQU  H'0000'
CCP2IF           EQU  H'0001'
CCP3IF           EQU  H'0002'
CCP4IF           EQU  H'0003'
CCP5IF           EQU  H'0004'


;----- PIR8 Bits -----------------------------------------------------
NVMIF            EQU  H'0005'
CRCIF            EQU  H'0006'
SCANIF           EQU  H'0007'


;----- PIR9 Bits -----------------------------------------------------
SMU1IF           EQU  H'0000'
SMU1PRAIF        EQU  H'0001'
SMU1PWAIF        EQU  H'0002'
SMU2IF           EQU  H'0003'
SMU2PRAIF        EQU  H'0004'
SMU2PWAIF        EQU  H'0005'


;----- WDTCON0 Bits -----------------------------------------------------
SEN              EQU  H'0000'

SWDTEN           EQU  H'0000'
PS0              EQU  H'0001'
PS1              EQU  H'0002'
PS2              EQU  H'0003'
PS3              EQU  H'0004'
PS4              EQU  H'0005'

WDTSEN           EQU  H'0000'

WDTPS0           EQU  H'0001'
WDTPS1           EQU  H'0002'
WDTPS2           EQU  H'0003'
WDTPS3           EQU  H'0004'
WDTPS4           EQU  H'0005'


;----- WDTCON1 Bits -----------------------------------------------------
WINDOW0          EQU  H'0000'
WINDOW1          EQU  H'0001'
WINDOW2          EQU  H'0002'
CS0_WDTCON1      EQU  H'0004'
CS1_WDTCON1      EQU  H'0005'
CS2_WDTCON1      EQU  H'0006'


WDTWINDOW0       EQU  H'0000'
WDTWINDOW1       EQU  H'0001'
WDTWINDOW2       EQU  H'0002'
WDTCS0           EQU  H'0004'
WDTCS1           EQU  H'0005'
WDTCS2           EQU  H'0006'


;----- WDTL Bits -----------------------------------------------------
WDT0             EQU  H'0000'
WDT1             EQU  H'0001'
WDT2             EQU  H'0002'
WDT3             EQU  H'0003'
WDT4             EQU  H'0004'
WDT5             EQU  H'0005'
WDT6             EQU  H'0006'
WDT7             EQU  H'0007'


;----- WDTPSL Bits -----------------------------------------------------
WDT0             EQU  H'0000'
WDT1             EQU  H'0001'
WDT2             EQU  H'0002'
WDT3             EQU  H'0003'
WDT4             EQU  H'0004'
WDT5             EQU  H'0005'
WDT6             EQU  H'0006'
WDT7             EQU  H'0007'


;----- WDTH Bits -----------------------------------------------------
WDT8             EQU  H'0000'
WDT9             EQU  H'0001'
WDT10            EQU  H'0002'
WDT11            EQU  H'0003'
WDT12            EQU  H'0004'
WDT13            EQU  H'0005'
WDT14            EQU  H'0006'
WDT15            EQU  H'0007'


;----- WDTPSH Bits -----------------------------------------------------
WDT8             EQU  H'0000'
WDT9             EQU  H'0001'
WDT10            EQU  H'0002'
WDT11            EQU  H'0003'
WDT12            EQU  H'0004'
WDT13            EQU  H'0005'
WDT14            EQU  H'0006'
WDT15            EQU  H'0007'


